Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །སྐུ་ནི་རི་རབ་བཞིན་དུ་མཛེས་པར་གྲུབ།
en: Is that your body is beautiful like Mount Meru.

source: །ཉོན་མོངས་སྦྱང་སླད་བསམ་གཏན་བསྒོམས་མཛད་པས།
en: You trained in concentration to purify the afflictions.

source: །བསམ་གཏན་དེ་སྤྱད་པ་ཡི་འབྲས་བུ་དེས།
en: The result of your practice of concentration

source: །འགྲོ་བ་དག་ལ་ཉོན་མོངས་གནོད་མི་འགྱུར།
en: Is that beings are not harmed by afflictions.

source: །ཉོན་མོངས་གཅོད་པའི་ཤེས་རབ་བསྒོམས་མཛད་པས།
en: You trained in knowledge that destroys the afflictions.

source: །ཤེས་རབ་དེ་སྤྱད་པ་ཡི་འབྲས་བུ་དེས།
en: The result of your practice of knowledge

source: །འོད་གསལ་དམ་པ་རྣམ་པར་སྣང་ཞིང་མཛེས།
en: Is that you emit sublime and beautiful light.

source: །བྱམས་པའི་གོ་མནབས་ཉོན་མོངས་འཇོམས་མཛད་ཅིང་།
en: “With the armor of compassion, you have destroyed the afflictions

source: །སེམས་ཅན་ཀུན་ལ་ཐུགས་རྗེ་ཆེས་བྱུང་བ།
en: And developed great compassion for all beings.

source: །དགྱེས་པ་མཆོག་བརྙེས་བཏང་སྙོམས་མཆོག་ལྡན་པ།
en: You have attained perfect delight and excellent equanimity; We

source: །བདེ་གཤེགས་ཚངས་གྱུར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Bll-Gone One, Great Being, homage be to you!

source: །ཤེས་རབ་སྒྲོན་མའི་འོད་དང་གཟིས་འཕགས་ཤིང་།
en: “You are exalted by the splendor of the light of the lamp of knowledge

source: །གཏི་མུག་སྐྱོན་གྱི་མུན་པ་ཀུན་སེལ་བ།
en: And have cleared all darkness of delusion.

source: །འདྲེན་པ་སྟོང་གསུམ་དག་ན་མིག་གྱུར་པའི། །ཐུབ་པ་ལམ་སྟོན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to you, Able One Who Shows the Path— The leader, the eye in the trichiliocosm.

source: །རྫུ་འཕྲུལ་རྐང་པ་མངོན་ཤེས་མཆོག་ལ་མཁས།
en: “Skilled in the higher knowledge of the bases of miraculous powers,

source: །བདེན་པ་གཟིགས་ཤིང་དམ་པའི་དོན་བསླབས་པ།
en: You see the truth and have trained in the sacred meaning.

source: །རྒལ་ནས་སྲོག་ཆགས་གཞན་དག་སྒྲོལ་མཛད་པ།
en: Having crossed over, you liberate others;

source: །བདེ་གཤེགས་གྲོལ་གྱུར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to you, the Well-Gone One Who Liberates.

source: །ཐབས་དང་མངོན་ཤེས་དམ་པ་ཀུན་ལ་མཁས།
en: “Skilled in means and higher knowledge,

source: །འཆི་འཕོ་འཆི་འཕོ་མེད་པའི་འཕོ་བ་སྟོན།
en: You show a passing away that is devoid of death and rebirth.

source: །འཇིག་རྟེན་ཆོས་ཀྱི་རྗེས་སུ་འཐུན་མཛད་ཀྱང་།
en: Although you act harmoniously in accord with worldly law,

source: །འཇིག་རྟེན་གང་དུའང་ཆགས་པ་ཁྱོད་མི་མངའ། །
en: You are in no way attracted to the world.

source: གང་དག་ཁྱོད་ནི་ཉན་ཏམ་ལྟར་ལྷགས་པ། །དེ་དག་ཐོབ་པ་དམ་པ་བསམ་མི་ཁྱབ།
en: “Inconceivably excellent gains come to anyone Who merely comes to hear or see you.

source: །ཁྱོད་ལ་ཆོས་ཉིད་ཐོས་ཏེ་གང་དད་ཅིང་། །དགའ་བ་ཡངས་པ་སྐྱེས་པ་སྨོས་ཅི་འཚལ།
en: So how about those who actually listen to the Dharma And develop faith and joy?

source: །དགའ་ལྡན་གནས་རྣམས་ཀུན་ནི་མོག་མོག་གྱུར།
en: “The entire realm of the Heaven of Joy is gloomy,

source: །འཛམ་བུའི་གླིང་དུ་ཉི་མ་མངོན་དུ་ཤར།
en: But the sun has risen in Jambudvīpa.

source: །སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་མི་ཁྱབ།
en: You will awaken inconceivable trillions of creatures

source: །ཉོན་མོངས་གཉིད་ཀྱིས་ལོག་ལས་སད་པར་མཛད།
en: Who are asleep due to their afflictions.

source: །དེང་ནི་ཕོ་བྲང་འབྱོར་ཅིང་རྒྱས་གྱུར་ལ།
en: “Today the palace will be filled with wonders:

source: །བྱེ་བ་ཁྲག་ཁྲིག་ལྷ་རྣམས་ལང་ལོང་གྱུར།
en: It will be crowded with trillions of deities;

source: །ལྷ་ཡི་བུ་མོས་སིལ་སྙན་སྒྲ་ཕྱུང་བས།
en: It will resound with the music played by divine maidens;

source: །རྒྱལ་པོའི་ཁབ་ན་སིལ་སྙན་གྲགས་པར་འགྱུར།
en: In the king’s mansion, sweet music will be heard.

source: །བསོད་ནམས་གཟི་བརྗིད་རྫོགས་ཤིང་ལས་དགེ་བ། །བུད་མེད་གཟུགས་ཀྱི་མཆོག་དང་ལྡན་གྱུར་པ།
en: “The lady is endowed with supreme beauty, Nourished by the brilliance of her merit and virtuous actions.

source: །དེ་ཡི་སྲས་གྱུར་དེ་ནི་དེ་ལྟར་འབྱོར།
en: This perfect son of hers will outshine

source: །དཔལ་གྱིས་འཇིག་རྟེན་གསུམ་ནི་ཟིལ་གྱིས་གནོན།
en: The three worlds with his splendor.

source: །མི་མཆོག་འབྱུང་བ་དེ་ཡི་གཟི་བརྗིད་ཀྱིས། །དེ་ཕྱི་ཕྱིན་ཆད་ཕོ་བྲང་དམ་པ་འདིར། །ལུས་ཅན་རྣམས་ལ་འདོད་དང་འཐབ་རྩོད་མེད།
en: “The splendorous appearance of this perfect man Will henceforth prevent any greed and quarrels Among beings in this sublime palace.

source: །ཀུན་ཀྱང་བྱམས་པའི་སེམས་ཀྱིས་སྲི་ཞུར་བཅས།
en: All shall be lovingly reverential.

source: །འཁོར་ལོས་སྒྱུར་བའི་རིགས་རྒྱལ་བྱུང་བས་ན།
en: “With the birth in the family of a universal monarch,

source: །རྒྱལ་པོའི་རིགས་ནི་རབ་ཏུ་འཕེལ་བར་འགྱུར།
en: The royal line will surely prosper.

source: །སེར་སྐྱའི་གྲོང་འདི་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས།
en: Likewise this city of Kapilavastu will become prosperous

source: །རིན་ཆེན་མཛོད་ཀྱིས་རབ་ཏུ་གང་བར་འགྱུར།
en: And replete with treasures.

source: །གནོད་སྦྱིན་སྲིན་པོ་གྲུལ་བུམ་གསང་བ་པ།
en: “Hosts of yakṣas, rākṣasas, kumbhāṇḍas, guhyakas,

source: །ལྷ་དང་ལྷ་མིན་ཚོགས་རྣམས་དབང་པོར་བཅས།
en: Gods, and asuras, together with their leaders—

source: །མི་མཆོག་སྲུང་བ་གང་དག་གནས་པ་རྣམས། །དེ་དག་རིང་པོར་མི་ཐོགས་ཐར་པ་འཐོབ། །
en: All those who stand guard over the supreme man Will soon attain liberation.

source: གུས་དང་སྲི་ཞུ་ལ་ནི་གནས་ནས་སུ། །འདྲེན་པ་ཁྱོད་བསྟོད་བསོད་ནམས་གང་བསགས་པ། །ཀུན་ཀྱང་བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་བསྔོ།
en: “Guide, whatever merit accumulates As we praise you with respect and reverence, We dedicate it all to awakening.

source: །མི་ཡི་དམ་པ་ཁྱོད་ལྟར་མྱུར་དུ་ཤོག
en: Best of Men, may we quickly become like you!”

source: །བསྐྱོད་པར་བརྩམས་པའི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: This concludes the fifth chapter, on setting out.

source: དགེ་སློང་དག་དེ་ལྟར་དགུན་འདས་ཏེ། དཔྱིད་ཀྱི་དུས་ལ་དཔྱིད་ཟླ་ཐ་ཆུངས་ཀྱི་ཚེ།
en: Monks, the cold season had passed and it was the third month of spring.

source: སྐར་མ་ས་ག་ལ་བབ་པ་དུས་ཀྱི་དམ་པ་ལ་ཤིང་རྣམས་ཀྱི་ལོ་མ་རྒྱས་ཤིང་།
en: It was the finest season, when the moon enters the constellation Viśākhā.

source: མེ་ཏོག་མཆོག་ཏུ་རྒྱས་ནས་གྲང་དྲོ་དང་། མུན་པ་དང་། རྡུལ་མེད་ཅིང་སའི་གཞི་སྔོ་གཞོན་ནུ་སྐྱེས་པས་ཁེབས་པར་གནས་པའི་ཚེ།
en: The leaves of trees unfurled and the most exquisite flowers blossomed. It was neither cold nor hot, and there was no fog or dust in the air. Fresh green grass covered the grounds everywhere.

source: འཇིག་རྟེན་གསུམ་གྱི་གཙོ་བོ་འཇིག་རྟེན་གྱིས་མཆོད་པས་དུས་ལ་བབ་པའི་ཚོད་ལ་རྣམ་པར་གཟིགས་ནས།
en: The Lord of the Three Worlds, revered by all the worlds, now judged that the time had come.

source: ཚེས་བཅོ་ལྔའི་ཟླ་བ་ཉ་ལ་སྐར་མ་རྒྱལ་གྱི་དུས་སུ། ཡུམ་གསོ་སྦྱོང་བླངས་པའི་རུམ་དུ། བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་དམ་པ་ནས་འཕོས་ཏེ། དྲན་ཞིང་ཤེས་བཞིན་དུ།
en: On the fifteenth day, during the full moon, while his future mother was observing the poṣadha precepts during the constellation of Puṣya, the Bodhisattva moved, fully conscious and aware, from the fine realm of the Heaven of Joy to the womb of his mother.

source: གླང་པོའི་ཕྲུ་གུ་ཐལ་ཀར་མཆེ་བ་དྲུག་དང་ལྡན་པ།
en: He entered through his mother’s right side in the form of a baby elephant, white in color with six tusks.

source: མགོའི་ཁ་དོག་སྲིན་བུ་ལྷམ་བུ་ཆུ་གཤེར་གྱི་མདོག་ལྟ་བུ། མཆེ་བ་ལ་གསེར་འཚིག་པ།
en: His head was the color of a reddish insect, and the tusks were blazing gold.

source: ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དང་ལྡན་པ། དབང་པོ་ཉམས་པ་མེད་པར་བྱས་ཏེ།
en: He had all his limbs intact and his full faculties.

source: མའི་གློ་གཡས་པ་ནས་ཞུགས་སོ། །ཞུགས་ནས་ཀྱང་གློ་གཡས་པ་ལོགས་སུ་བརྟེན་ཏེ་གནས་ཀྱི། གློ་གཡོན་པ་ལོགས་སུ་ནམ་ཡང་མ་བརྟེན་ཏོ།
en: As he entered, he stayed only at the right side of the womb and never on the left.

source: །ལྷ་མོ་སྒྱུ་འཕྲུལ་མལ་བདེ་བ་ན་ཉལ་བ་དེས་ཀྱང་རྨི་ལམ་འདི་ལྟ་བུ་མཐོང་ངོ་།
en: As this occurred, Queen Māyā was sleeping on her pleasant bed and saw the following in her dream:

source: །གླང་པོ་ཁ་བ་དངུལ་མདོག་མཆེ་བ་དྲུག །རྐང་ལག་རབ་མཛེས་མགོ་བོ་དམར་སྡུག་པ།
en: A snowy-silver colored elephant with six tusks, Beautiful feet, exquisite trunk, and a pretty red head,

source: །འགྲོས་བཟང་ལུས་ཚིགས་རྡོ་རྗེ་བཞིན་བརྟན་པ།
en: Moving in a fine gait with joints as stable as a diamond—

source: །གླང་པོ་མཆོག་གཅིག་ཁོང་དུ་སོང་སྙམ་བྱེད། །
en: That perfect elephant entered her womb.

source: དེས་ནི་དེ་འདྲའི་བདེ་བ་བརྒྱ་ལམ་ནའང་། །མ་མཐོང་མ་ཐོས་མྱོང་བར་མ་གྱུར་ཏེ།
en: She had never seen, heard of, or experienced Such a rare happiness.

source: །ལུས་ཀྱང་བདེ་ཞིང་སེམས་ཀྱང་བདེར་གྱུར་ནས།
en: Feeling this physical and mental bliss,

source: །བསམ་གཏན་མཉམ་པར་བཞག་པ་བཞིན་དུ་གྱུར།
en: She became absorbed in concentration.

source: །དེ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་རྒྱན་དང་གོས་ལྷུག་ལྷུག་པོར་གྱོན་ཅིང་།
en: As she awoke, Queen Māyā first adorned herself with ornaments and flowing garments.

source: ཐོགས་པ་ལས་ལུས་དང་སེམས་བདེ་བར་གྱུར་ཏེ། དགའ་བ་དང་། རངས་པ་དང་། ཉམས་བདེ་བ་ཐོབ་ནས།
en: Refreshed in body and mind, she felt affectionate, joyful, and calm.

source: མལ་དམ་པ་དེ་ལས་ལངས་ཏེ་བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་ཁང་བཟངས་དེའི་སྟེང་ནས་བབས་ཏེ།
en: She then arose from her bed and made her way down from the upper floors of the palace, surrounded by her female attendants.

source: ཤིང་མྱ་ངན་འཚང་གི་ནགས་ཚལ་ག་ལ་བ་དེར་སོང་ནས། དེ་མྱ་ངན་འཚང་གི་ནགས་ཚལ་དུ་བདེ་བར་འདུག་སྟེ།
en: She proceeded to the aśoka-tree forest, where she felt at ease.

source: རྒྱལ་པོ་ཟས་གཙང་མའི་དྲུང་དུ་ཕོ་ཉ་བཏང་ནས།
en: Once there, she sent a message to King Śuddhodana:

source: རྒྱལ་པོ་གཤེགས་སུ་གསོལ། ལྷ་མོ་དེ་ཁྱོད་ཀྱི་ཞལ་མཐོང་བར་བཞེད་དོ།
en: “Your Majesty, please come, the queen would like to see you.”

source: །ཞེས་བྱས་པ་དང་། རྒྱལ་པོ་ཟས་གཙང་མས་ཚིག་དེ་ཐོས་ནས། རབ་ཏུ་དགའ་བར་གྱུར་ཏེ། ལུས་གཡོས་ནས་ཁྲི་བཟང་པོ་ལས་ལངས་ཏེ།
en: When King Śuddhodana heard this message, he became very elated, and immediately he rose from his throne.

source: བློན་པོ་དང་། གྲོང་རྡལ་པ་དང་། འཁོར་དང་། གཉེན་པའི་སྐྱེ་བོ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། མྱ་ངན་འཚང་གི་ནགས་ཚལ་ག་ལ་བ་དེར་སོང་ངོ་།
en: Surrounded by his ministers and townspeople, attendants and relatives, he went to the aśoka forest.

source: །སོང་ནས་ཀྱང་བདག་གི་ལུས་ཤིན་ཏུ་ལྕི་བ་སྙམ་བྱེད་ནས། མྱ་ངན་འཚང་གི་ནགས་ཚལ་དུ་འགྲོ་མ་ནུས་ཏེ།
en: However, as he arrived, his body suddenly felt very heavy and he was unable to enter the forest.

source: མྱ་ངན་འཚང་གི་ནགས་ཚལ་གྱི་སྒོར་འདུག་ནས།
en: In this way he just stood at the entrance to the aśoka forest.

source: ཅུང་ཟད་ཅིག་བསམས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: Reflecting a little, he then spoke these verses:

source: བདག་ནི་གཡུལ་དུ་དཔའ་བའི་ཕུལ་ཕྱིན་པ།
en: “I do not remember my body ever feeling this heavy, Even as I led my army of warriors into battle.

source: །དེང་ལྟར་ལུས་ལྕི་བདག་གིས་མྱོང་མི་དྲན།
en: Now I cannot even enter my own property;

source: །བདག་གི་ཁྱིམ་དུའང་འགྲོ་བར་དེང་མ་ནུས།
en: Can anyone tell me what has happened?”

source: །ཀྱེ་མ་འདི་ཅི་སུ་ལ་དྲི་བར་བྱ། །གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་དག་ནམ་མཁའི་དཀྱིལ་ན་འཁོད་ནས་ལུས་ཕྱེད་མངོན་པར་སྤྲུལ་ཏེ།
en: Some gods of the pure realms had settled in the middle of the sky. Now they revealed half their bodies and spoke these verses to King Śuddhodana:

source: རྒྱལ་པོ་ཟས་གཙང་མ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Your Majesty, a bodhisattva, a great being,

source: དཀའ་ཐུབ་བརྟུལ་ཞུགས་ཡོན་ཏན་ལྡན་པ་འཇིག་རྟེན་གསུམ་གྱིས་མཆོད།
en: With qualities of austerity and discipline, honored by the three worlds,

source: །བྱམས་དང་སྙིང་རྗེ་ཐོབ་པས་བསོད་ནམས་ཡེ་ཤེས་དབང་བསྐུར་བའི།
en: Loving and compassionate, and empowered by merit and wisdom,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆེ་བ་དགའ་ལྡན་གནས་ནས་འཕོས་གྱུར་ཏེ། །རྒྱལ་པོ་ཁྱོད་ཀྱི་སྲས་གྱུར་ལྷ་མོ་སྒྱུ་འཕྲུལ་མངལ་དུ་ཞུགས།
en: Has left the Heaven of Joy for the womb of Queen Māyā in order to become your son.”

source: །དེ་ཚེ་རང་གི་མགོ་ཅོགས་སོར་བཅུ་ཐལ་མོ་སྦྱར་བྱས་ཏེ།
en: Then, joining his palms and bowing his head,

source: །རྒྱལ་པོ་རིམ་གྲོ་བྱ་བར་ལྡན་གྱུར་དེ་ཡི་ནང་དུ་ཞུགས།
en: The king went into the forest, overwhelmed by reverence and awe.

source: །ང་རྒྱལ་དྲེགས་པ་མེད་པས་ལྷ་མོ་སྒྱུ་འཕྲུལ་ངོར་བལྟས་ཏེ།
en: Without pride or arrogance, he looked at Queen Māyā

source: །ངས་ནི་ཁྱོད་ལ་ཅི་བྱ་ཅི་སྦྱར་ཁྱོད་ཀྱིས་ང་ལ་སྨྲོས།
en: And asked, “What may I do for you? Tell me what to do.”

source: །ལྷ་མོས་སྨྲས་པ།
en: The queen replied:

source: ཁ་བ་དངུལ་གྱི་མདོག་འདྲ་ཉི་ཟླའི་འོད་ལས་འཕགས་པ་སྟེ། །རྐང་ལག་ལེགས་ཤིང་རབ་འབྱེས་མཆེ་བ་དྲུག་ལྡན་ཆེ་བ་ཉིད། །གླང་པོའི་དམ་པ་རྡོ་རྗེ་བཞིན་དུ་ཚིགས་བརྟན་གཟུགས་བཟང་བ། །བདག་གི་རུམ་དུ་ཞུགས་ཀྱིས་དེ་ཡི་ལོ་རྒྱུས་གསན་པར་གསོལ།
en: “A fine and beautiful elephant, white as snow or silver, More dazzling than the sun and the moon, well proportioned, With beautiful legs, six great tusks, and joints as firm as diamond, Entered my womb—please listen to this story.

source: །སྟོང་གསུམ་ཁམས་འདི་མཛེས་པར་རབ་རིབ་མ་མཆིས་བདག་གིས་མཐོང་།
en: “In my sleep I saw this trichiliocosm illuminated, its darkness gone,

source: །བདག་ནི་ཉལ་ཞིང་མཆིས་ན་ལྷ་རྣམས་བྱེ་བས་རབ་ཏུ་བསྟོད།
en: While ten million gods were praising me.

source: །འོན་ཀྱང་བདག་ལ་ཁྲོ་ཞིང་འཚིག་དང་ཞེ་སྡང་རྨོངས་མ་མཆིས།
en: I felt no anger, aggression, hatred, or confusion;

source: །ཞི་བའི་སེམས་སུ་གྱུར་ཅིང་བསམ་གཏན་བདེ་དང་ལྡན་སྙམ་བགྱིད།
en: I felt peaceful and full of the bliss of concentration.

source: །བདག་གི་རྨི་ལམ་འདི་ནི་རིགས་ལ་དགེའམ་དངོ་འམ་ཅི། བདག་གི་རྨི་ལམ་འདི་ནི་ཡང་དག་ལྡན་པར་ལུང་སྟོན་པ། །རིག་བྱེད་རྨི་ལམ་གཞུང་ལ་མཁས་ཤིང་གཟའ་ཡི་ཆོ་ག་མཁན།
en: “I wonder if this dream of mine shows happiness or sorrow for our family? Is my dream a genuine prediction?

source: །རྒྱལ་པོ་མྱུར་དུ་བྲམ་ཟེ་འདིར་ནི་ལེགས་པར་དགུག་ཏུ་གསོལ།
en: Your Majesty, quickly summon the priests Who are specialists in the Vedic treatises on dreams.”

source: །དེ་སྐད་ཚིག་ཐོས་རྒྱལ་པོས་དེ་ཡི་དུས་ཀྱི་སྐད་ཅིག་ལ།
en: Hearing these words, the king instantly summoned the priests

source: །བྲམ་ཟེ་རིག་བྱེད་བསྟན་བཅོས་གཞུང་ལ་ཤིན་ཏུ་མཁས་པ་གཉེར།
en: Who were experts in the Vedas and their treatises.

source: །སྒྱུ་འཕྲུལ་བྲམ་ཟེ་རྣམས་ཀྱི་མདུན་དུ་འདུག་ནས་འདི་སྐད་སྨྲས།
en: When the priests stood before Queen Māyā, she said, “Listen to my story;

source: །ཁོ་མོས་རྨི་ལམ་འདི་འདྲ་མཐོང་ན་དེ་ཡི་ལོ་རྒྱུས་གསོན།
en: this is what I dreamed.”

source: །བྲམ་ཟེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་མོ་བཀའ་སྩལ་དུ་གསོལ།
en: The brāhmins replied, “Your Majesty, please speak.

source: ཁྱོད་ཀྱིས་རྨི་ལམ་ཅི་འདྲ་བ་ཞིག་གཟིགས། ཐོས་ནས་ཀྱང་དཔྱད་པར་བགྱིའོ།
en: When we hear what you saw in your dream, we will explain.”

source: ཁ་བ་དངུལ་གྱི་མདོག་འདྲ་ཉི་ཟླའི་འོད་ལས་འཕགས་པ་སྟེ། །རྐང་ལག་ལེགས་ཤིང་རབ་འབྱེས་མཆེ་བ་དྲུག་ལྡན་ཆེ་བ་ཉིད། །
en: “A fine and beautiful elephant, white as snow or silver, More dazzling than the sun and the moon, well proportioned,

source: གླང་པོའི་དམ་པ་རྡོ་རྗེ་བཞིན་དུ་ཚིགས་བརྟན་གཟུགས་བཟང་བ།
en: With beautiful legs, six great tusks, and joints as firm as diamond,

source: །བདག་གི་རུམ་དུ་ཞུགས་ན་དེ་ཡི་ལོ་རྒྱུས་མཉན་པར་གྱིས།
en: Entered my womb—please listen to this story.”

source: །དེ་སྐད་ཚིག་ཐོས་ནས་ནི་བྲམ་ཟེ་རྣམས་ཀྱིས་འདི་སྐད་སྨྲས།
en: As they heard these words, the priests remarked,

source: །རིགས་ལ་དངོ་བ་མ་མཆིས་དགྱེས་པ་རྒྱ་ཆེན་བརྙེས་པར་འགྱུར།
en: “Your clan shall meet no sorrow but only extensive delight.

source: །ཁྱོད་ལ་སྲས་མངའ་མཚན་གྱིས་ཡན་ལག་བརྒྱན་པ་སྐྱེ་བར་འགྱུར།
en: A son will be born to you, his limbs adorned with the marks;

source: །རྒྱལ་པོའི་རིགས་སུ་རིགས་ལྡན་འཁོར་ལོས་སྒྱུར་བ་ཆེ་བ་ཉིད།
en: He will belong to the lineage of kings, a great universal monarch.

source: །གལ་ཏེ་འདོད་པ་དག་དང་རྒྱལ་སྲིད་ཕོ་བྲང་སྤངས་གྱུར་ཏེ།
en: “If he renounces his pleasures, his kingdom, and his palace,

source: །འཇིག་རྟེན་ཀུན་ལ་ཐུགས་བརྩེ་ཆགས་མེད་རབ་ཏུ་བྱུང་གྱུར་ན།
en: And goes forth as a monk, unattached, full of compassion and love for the world,

source: །དེ་ནི་འཇིག་རྟེན་གསུམ་ན་སྦྱིན་གནས་སངས་རྒྱས་འགྱུར་བ་སྟེ།
en: He will become a buddha worthy of offerings in the three worlds.

source: །བདུད་རྩི་མཆོག་གི་རོ་ཡིས་འཇིག་རྟེན་ཐམས་ཅད་ཚིམ་མཛད་འགྱུར།
en: He will satisfy the world with the supreme taste of the nectar of immortality.”

source: །དེ་སྐད་ཚིག་སྙན་ལུང་བསྟན་ཏེ།
en: Following this positive prediction,

source: །རྒྱལ་པོའི་ཕོ་བྲང་ཟན་ཟོས་ནས།
en: The priests had their meal in the royal palace,

source: །བྱ་དགའ་བྱིན་པ་བླངས་ནས་སུ།
en: Accepted an offering of gifts,

source: །བྲམ་ཟེ་དེ་དག་ཕྱིར་དོང་ངོ་།
en: And subsequently departed.

source: །དགེ་སློང་དག་དེ་ལྟར་རྒྱལ་པོ་ཟས་གཙང་མས་བྲམ་ཟེ་མཚན་དང་ལྟས་ཤེས་ཤིང་རྣམ་པར་འབྱེད་པ་དང་། རྨི་ལམ་གྱི་གཞུང་ཤེས་པ་དག་ལས་དེ་སྐད་ཀྱི་ཚིག་དེ་ཐོས་ནས།
en: Monks, when King Śuddhodana heard that message from the priests who understood how to analyze marks and signs and who knew the scriptures related to dreams, he was satisfied.

source: ཚིམ་ཞིང་མགུ་སྟེ། ཡི་རངས་ལ། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Impressed, delighted, and joyful, he felt blissful and happy.

source: བྲམ་ཟེ་དེ་དག་བཟའ་བ་དང་བཏུང་བ་དང་། མྱང་བ་མང་པོ་ཉམས་སུ་བསོད་པས་ཚིམ་ཞིང་ངོམས་པར་བྱས་ནས། བྱ་དགའ་བྱིན་ཏེ་བཀྱེའོ།
en: He pleased the priests by offering them delicious food and drink. When they were all full, he entertained them and presented them with gifts before they departed.

source: །དེ་ཉིད་ཀྱི་ཚེ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དེའི་སྒོ་བཞི་ན། གྲོང་ཁྱེར་གྱི་བཞི་མདོ་དང་སུམ་མདོ་ཐམས་ཅད་དུ་སྦྱིན་པ་བྱིན་ཏེ། ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར།
en: At the same time, as an offering to the Bodhisattva, alms were distributed at the four gates of the city of Kapilavastu and at all its crossroads and junctions.

source: ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས། སྐོམ་འདོད་པ་རྣམས་ལ་ནི་སྐོམ།
en: The king offered food to those who were hungry, and drink to those who were thirsty.

source: གོས་འདོད་པ་རྣམས་ལ་ནི་གོས། བཞོན་པ་འདོད་པ་རྣམས་ལ་ནི་བཞོན་པ། སྤོས་འདོད་པ་རྣམས་ལ་ནི་སྤོས། ཕྲེང་བ་འདོད་པ་རྣམས་ལ་ནི་ཕྲེང་བ། བྱུག་པ་འདོད་པ་རྣམས་ལ་ནི་བྱུག་པ། མལ་ཆ་འདོད་པ་རྣམས་ལ་ནི་མལ་ཆ། གནས་འདོད་པ་རྣམས་ལ་ནི་གནས། འཚོ་བ་འདོད་པ་རྣམས་ལ་ནི་འཚོ་བ་བྱིན་ནོ།
en: He offered clothes to those who needed clothing, carriages to those who required transportation, perfumes to those who desired perfume, garlands to those who wished for garlands, oils to those who wanted ointments, sheets to those who longed for bedding, shelter to the homeless, and necessities to those who yearned for provisions.

source: །དགེ་སློང་དག་དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མ་འདི་སྙམ་དུ་སེམས་ཏེ། ལྷ་མོ་སྒྱུ་འཕྲུལ་འདི་ཁྱིམ་གང་ན་འདུག་ན་བདེ་ཞིང་ཉོན་མོངས་པ་མེད་པར་འདུག་པར་འགྱུར་སྙམ་པ་དང་། དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་རྒྱལ་པོ་ཟས་གཙང་མའི་དྲུང་དུ་འོངས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, monks, King Śuddhodana considered, “I wonder in which residence Queen Māyā can stay happily and without affliction?” At that very instant the Four Great Kings approached King Śuddhodana and spoke to him:

source: །ལྷ་ཐུགས་ལས་སུ་མ་མཛད་པར་བཏང་སྙོམས་སུ་བདེ་བར་བཞུགས་ཤིག །བདག་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཕོ་བྲང་བཤམ་མོ།
en: “Your Majesty, do not worry; remain happily in equanimity. We will prepare a palace for the Bodhisattva.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་རྒྱལ་པོ་ཟས་གཙང་མའི་གན་དུ་འོངས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Śakra, lord of the gods, approached King Śuddhodana and spoke to him:

source: །སྐྱོང་བའི་གཞལ་མེད་ཁང་རྣམས་ངན།
en: “The palaces of the protectors are no good;

source: །སུམ་ཅུ་རྩ་གསུམ་པ་ཡི་བཟང་།
en: Those of the Heaven of the Thirty-Three are better.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཕོ་བྲང་ནི།
en: I will give the Bodhisattva a palace

source: །རྣམ་པར་རྒྱལ་ཙམ་བདག་གིས་དབུལ།
en: Equal to my Vaijayanta.”

source: །དེ་ནས་ལྷའི་བུ་རབ་འཐབ་བྲལ་རྒྱལ་པོ་ཟས་གཙང་མའི་གན་དུ་འོངས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then a god from the Heaven Free from Strife approached King Śuddhodana and spoke to him:

source: །ཁོ་བོའི་ཁང་ཁྱིམ་མཐོང་གྱུར་ནས། །བརྒྱ་བྱིན་བྱེ་བ་ངོ་མཚར་གྱུར།
en: “When ten million gods of Śakra’s realm See my mansion, they marvel.

source: །འཐབ་བྲལ་རབ་ཀྱི་དཔལ་ལྡན་ཁང་། །རྒྱལ་བའི་སྲས་ལ་བདག་འབུལ་ལོ།
en: This glorious house, the best of the Heaven Free from Strife, I give to the king’s son.”

source: །དེ་ནས་ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་རྒྱལ་པོ་ཟས་གཙང་མའི་གན་དུ་འོངས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then a god from the Heaven of Joy approached King Śuddhodana and spoke to him:

source: །གྲགས་པ་ཆེ་མངའ་སྔོན་ཆད་ནི།
en: “Previously this renowned being

source: །དགའ་ལྡན་གང་དུ་བཞུགས་གྱུར་པ།
en: Dwelt in a delightful palace

source: །ཕོ་བྲང་དམ་པ་དགྱེས་པ་དེ།
en: When he was in the Heaven of Joy.

source: །རྒྱལ་བའི་སྲས་ལ་བདག་འབུལ་ལོ།
en: That palace I will now offer to the Bodhisattva.”

source: །དེ་ནས་ལྷའི་བུ་རབ་འཕྲུལ་དགའ་རྒྱལ་པོ་ཟས་གཙང་མའི་གན་དུ་འོངས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then a god from the Heaven of Delighting in Emanations approached King Śuddhodana and spoke to him:

source: །དཔལ་ལྡན་ཡིད་ལས་གྲུབ་པའི་ཁང་།
en: “A glorious, mentally created mansion

source: །དེ་ནི་རིན་ཆེན་རང་བཞིན་ཏེ།
en: That is made of jewels,

source: །བྱང་ཆུབ་སེམས་དཔའ་མཆོག་དོན་དུ།
en: I will give to the Bodhisattva, king,

source: །རྒྱལ་པོ་བདག་གིས་དབུལ་བར་བགྱིས།
en: As an act of worship.”

source: །དེ་ནས་ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་རྒྱལ་པོ་ཟས་གཙང་མའི་གན་དུ་འོངས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then a god from the Heaven of Making Use of Others’ Emanations approached King Śuddhodana and spoke to him:

source: འདོད་པའི་ཁམས་གནས་ཇི་སྙེད་པ། །གཞལ་མེད་ཁང་མཛེས་གང་ཡོད་པ། །བདག་གི་གཞལ་མེད་ཁང་དྲུང་ན། འོད་དང་མདོག་ཀྱང་སྟོར་བར་སྣང་།
en: “The resplendence of my mansion Eclipses the light and colors Of any beautiful mansion Anywhere in the desire realm.

source: །དེ་བས་དཔལ་ལྡན་བདག་གིས་དབུལ།
en: “So let me give that glorious mansion

source: །བྱང་ཆུབ་སེམས་དཔའ་མཆོད་པའི་ཕྱིར།
en: As an offering to the Bodhisattva.

source: །རིན་ཆེན་རང་བཞིན་ཕོ་བྲང་བཟང་། །དེ་ནི་རྒྱལ་པོ་བླང་བར་གྱིས།
en: Your Majesty, I will bring My beautiful jewel palace.

source: །ལྷ་ཡི་མེ་ཏོག་རབ་བཀང་སྟེ།
en: “It is strewn with divine flowers

source: །ལྷ་ཡི་སྤོས་ཀྱི་ངད་ལྡང་བའི།
en: And scented with divine perfumes.

source: །ཕོ་བྲང་ཡངས་པ་བདག་གིས་དབུལ།
en: I will offer this spacious palace;

source: །དེར་ནི་ལྷ་མོ་བཞུགས་པར་གྱིས།
en: There the queen may remain.”

source: །དགེ་སློང་དག་དེ་ལྟར་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ཕྱིར་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དམ་པ་དེར་རང་རང་གི་ཁྱིམ་ཕུལ་བར་གྱུར་ཏོ།
en: Monks, in this way each of the eminent gods of the desire realm individually presented their respective residences as an offering to the Bodhisattva, right there in the fine city of Kapilavastu. King Śuddhodana also provided an excellent mansion.

source: །རྒྱལ་པོ་ཟས་གཙང་མས་ཀྱང་མིའི་ལས་ནི་འདས་ཀྱི་ལྷ་ཡིར་ནི་མ་གྱུར་པ་བཤམས་པར་གྱུར་ཏེ།
en: It far surpassed those built by other humans, although it could not match the divine palaces.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བཀོད་པ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱི་མཐུས་ཁྱིམ་དེ་དག་ཐམས་ཅད་དུ་ལྷ་མོ་སྒྱུ་འཕྲུལ་མངོན་པར་བསྟན་ཏོ།
en: However, by the power of the Bodhisattva resting in the absorption known as the great array, Queen Māyā appeared in all of those residences.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱི་རུམ་ན་འདུག་པའི་ཚེ། གློ་གཡས་ཕྱོགས་ལོགས་སུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་གནས་པར་གྱུར་ཏོ།
en: During the period when the Bodhisattva stayed in Queen Māyā’s womb, he remained on the right side of the womb, seated in a cross-legged posture.

source: །ལྷའི་དབང་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་སོ་སོ་ནས་བདག་ཉིད་ཀྱི་ཁྱིམ་ན་བྱང་ཆུབ་སེམས་དཔའི་མ་འདུག་གི་གཞན་མ་ཡིན་ནོ་ཞེས་དེ་ལྟར་ཤེས་པར་གྱུར་ཏོ།
en: In addition all the chief gods believed that the mother of the Bodhisattva remained only in the residence they had given her, and not anywhere else.

source: ཏིང་འཛིན་བཀོད་པ་ཆེ་ལ་གནས་གྱུར་ཏེ།
en: While the Bodhisattva remained in the absorption known as the great array,

source: །སྤྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་སྤྲུལ་བྱས་ནས།
en: He emanated inconceivable magical displays,

source: །ལྷ་རྣམས་ཐམས་ཅད་བསམ་པ་རྫོགས་པར་བྱས།
en: Which perfectly fulfilled the wishes of all the gods.

source: །རྒྱལ་པོའང་དེ་ལྟར་ཡིད་བཞིན་བསམ་པ་གྲུབ།
en: The wishes of the king, too, became fulfilled.

source: །དེ་ནས་འཁོར་དེའི་ནང་ནས་ལྷའི་བུ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་གང་ཡིན་པ་དེ་དག་ཀྱང་མིའི་ལུས་ཀྱི་དྲི་བྲོ་ན་སྐྱོ་ཞིང་འབྱོལ་ན།
en: Then some gods among the assembly began to wonder, “Even the gods in the Heaven of the Four Great Kings turn back when they approach human habitations.

source: དེ་མ་ཡིན་པའི་ལྷ་གཞན་སུམ་ཅུ་རྩ་གསུམ་མམ། འཐབ་བྲལ་ལམ། དགའ་ལྡན་གྱི་ལྷའི་བུ་དག་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ན།
en: So what about the gods of the highest order—those in the Heaven of the Thirty-Three, the Heaven Free from Strife, or the Heaven of Joy?
